#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-6bcvSybv8fZBZqe9

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/942.4ed9a84c.chunk.js.map"]: Refreshing state... [id=static/js/942.4ed9a84c.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/719.a25f1e9e.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js.map"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js"]: Refreshing state... [id=static/js/main.af5459d2.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/942.b7abd170.chunk.css.map"]: Refreshing state... [id=static/css/942.b7abd170.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/942.4ed9a84c.chunk.js"]: Refreshing state... [id=static/js/942.4ed9a84c.chunk.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.af5459d2.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"]: Refreshing state... [id=static/js/924.16f99540.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js.map"]: Refreshing state... [id=static/js/719.a25f1e9e.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css"]: Refreshing state... [id=static/css/main.dce9ee63.css]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js.map"]: Refreshing state... [id=static/js/main.af5459d2.js.map]
module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js"]: Refreshing state... [id=static/js/719.a25f1e9e.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css.map"]: Refreshing state... [id=static/css/main.dce9ee63.css.map]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js.map"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"]: Refreshing state... [id=static/js/924.16f99540.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/css/942.b7abd170.chunk.css"]: Refreshing state... [id=static/css/942.b7abd170.chunk.css]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js.LICENSE.txt"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "fcf2b0c3ced0849f09ce3219e341fc99" -> "a98e4e8265fbd8b336ff48e2c98c6ce9"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "QFGu197rXNtuYaeKypa0KLb2WVw.IFpW" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "3c62334417e76266b5e01fde2b954ff4" -> "504b49a09da54db0c2dd1192bae835cc"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "srGyVQYZtQc02QlMMYRCZeeeG3XsxpJX" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "2084e2d3e64165e964600deb61345b4a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/612.11e8f03c.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/612.11e8f03c.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "81e0574e15634d72b0a4e785489e68ad"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/612.11e8f03c.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/612.11e8f03c.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/942.b7abd170.chunk.css"] will be destroyed
  # (because key ["static/css/942.b7abd170.chunk.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "ce99aeea19c88317752343c3374434fe" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/942.b7abd170.chunk.css" -> null
      - key                    = "static/css/942.b7abd170.chunk.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/942.b7abd170.chunk.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "tcO6bTGk_wJ9o6OJkTM19gFFroggUJ7h" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/942.b7abd170.chunk.css.map"] will be destroyed
  # (because key ["static/css/942.b7abd170.chunk.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "bb3a334eb3e913381c20e71a7ca4a0c2" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/942.b7abd170.chunk.css.map" -> null
      - key                    = "static/css/942.b7abd170.chunk.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/942.b7abd170.chunk.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "x4UjyJt6K9Rybqw0TSss5syyofF9lalJ" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "40eef88aed6fa0158222e5ad03184206"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/518.86d0a8b8.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/518.86d0a8b8.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "686f404fb6748c84bd90802c573b89fc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/518.86d0a8b8.chunk.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/518.86d0a8b8.chunk.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "64b1687d5cadeaa48de73bd80710ab4b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/518.86d0a8b8.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/518.86d0a8b8.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.b7987671.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "2dd1c9c7c90dcd235108f5664c68d82d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/612.b7987671.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/612.b7987671.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.b7987671.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "172bcdc3b0529b875ca957c7ccb2baf5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/612.b7987671.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/612.b7987671.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js"] will be destroyed
  # (because key ["static/js/719.a25f1e9e.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5d278ff08a7051b876a7dc5670cb8d8b" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/719.a25f1e9e.chunk.js" -> null
      - key                    = "static/js/719.a25f1e9e.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/719.a25f1e9e.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "l1DuGlN.0qwDyA7mAXQ5diORKjuO5fmi" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/719.a25f1e9e.chunk.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "686f404fb6748c84bd90802c573b89fc" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/719.a25f1e9e.chunk.js.LICENSE.txt" -> null
      - key                    = "static/js/719.a25f1e9e.chunk.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/719.a25f1e9e.chunk.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "W7vOFTQb92Ud3ONdma0oCmy34rQ6lMWn" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js.map"] will be destroyed
  # (because key ["static/js/719.a25f1e9e.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "a3f3e2e77bb99fb1db1c90397194ba3f" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/719.a25f1e9e.chunk.js.map" -> null
      - key                    = "static/js/719.a25f1e9e.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/719.a25f1e9e.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "ZZ7r4Wbmc.gZ7xx.Q7wBcjqvqFpSHTLA" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/942.4ed9a84c.chunk.js"] will be destroyed
  # (because key ["static/js/942.4ed9a84c.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "88662980c7440f8c2d3bcc8d670fdb9d" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/942.4ed9a84c.chunk.js" -> null
      - key                    = "static/js/942.4ed9a84c.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/942.4ed9a84c.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "hRpQVjHvgcwX5nnN5AC17LimsT5VhgzL" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/942.4ed9a84c.chunk.js.map"] will be destroyed
  # (because key ["static/js/942.4ed9a84c.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "20c086546d6d0bf459a38db89b0a6ad4" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/942.4ed9a84c.chunk.js.map" -> null
      - key                    = "static/js/942.4ed9a84c.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/942.4ed9a84c.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "usP.iCWIUIenLIW8tdqRVPiEcnUnPAj_" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.2c436c3e.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "cadcade5ca129b72fe3e00ec3eeb6f3a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.2c436c3e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.2c436c3e.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.2c436c3e.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "c08095d410fcc127f60d880f425f8221"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.2c436c3e.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.2c436c3e.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.2c436c3e.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "9318d5e0558a92b0024a247fdbd16074"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.2c436c3e.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.2c436c3e.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js"] will be destroyed
  # (because key ["static/js/main.af5459d2.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6dfc39e9b54da1cd967eda088a535431" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.af5459d2.js" -> null
      - key                    = "static/js/main.af5459d2.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.af5459d2.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "KOPEEOusMaTMHseTn24r7R4fZZpQPi96" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.af5459d2.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "c08095d410fcc127f60d880f425f8221" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.af5459d2.js.LICENSE.txt" -> null
      - key                    = "static/js/main.af5459d2.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.af5459d2.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "7C4vE3ZqgrkqZiWfp5t3oH5fz7s6GGMy" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.af5459d2.js.map"] will be destroyed
  # (because key ["static/js/main.af5459d2.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "7843bc01585d748ed353bb707172804c" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.af5459d2.js.map" -> null
      - key                    = "static/js/main.af5459d2.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.af5459d2.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Xd5_5i9oiXBxOqXp4_FyGOL83KsNEM2s" -> null
    }

Plan: 10 to add, 2 to change, 10 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*